; domain
(define (domain regions)
    (:requirements :adl :strips :typing)
    (:types item location)
    (:predicates (connect-region ?x - location ?z - location)  (from-region ?x - location ?y - item)  (in-backpack ?y - item)  (in-kasa) (in-region ?x - location)  (kasa ?x - location))
    (:action move-to-region
        :parameters (?x - location ?z - location)
        :precondition (and (in-region ?x) (connect-region ?x ?z))
        :effect (and (not (in-region ?x)) (in-region ?z))
    )
     (:action take-to-backpack
        :parameters (?x - location ?y - item)
        :precondition (and (in-region ?x) (from-region ?x ?y))
        :effect (in-backpack ?y)
    )
     (:action zaplac
        :parameters (?x - location)
        :precondition (and (in-region ?x) (kasa ?x))
        :effect (and (not (in-region ?x)) (in-kasa))
    )
)

; problem
(define (problem problem-1)
    (:domain regions)
    (:objects Coca_Cola_2l Coca_cola_1 Coca_cola_1l Gumka_recepturka Komputer_lenovo Pomarancza_Luz - item KASA_1 KASA_2 KASA_3 MAGAZYN_1 WEJSCIE_1 WEJSCIE_2 o_0_15 o_0_27 o_0_3 o_12_15 o_12_3 o_13_17 o_13_27 o_13_5 o_15_27 o_16_15 o_16_3 o_17_17 o_17_5 o_1_17 o_1_5 o_4_15 o_4_3 o_5_17 o_5_27 o_5_5 o_7_27 o_8_15 o_8_3 o_9_17 o_9_5 - location)
    (:init (connect-region KASA_1 KASA_2) (connect-region KASA_1 WEJSCIE_1) (connect-region KASA_1 o_4_3) (connect-region KASA_2 KASA_1) (connect-region KASA_2 KASA_3) (connect-region KASA_2 o_4_3) (connect-region KASA_2 o_8_3) (connect-region KASA_3 KASA_2) (connect-region KASA_3 WEJSCIE_2) (connect-region KASA_3 o_12_3) (connect-region KASA_3 o_8_3) (connect-region MAGAZYN_1 o_13_27) (connect-region MAGAZYN_1 o_15_27) (connect-region MAGAZYN_1 o_7_27) (connect-region WEJSCIE_1 KASA_1) (connect-region WEJSCIE_1 o_0_3) (connect-region WEJSCIE_2 KASA_3) (connect-region WEJSCIE_2 o_12_3) (connect-region WEJSCIE_2 o_16_3) (connect-region o_0_15 o_1_17) (connect-region o_0_15 o_1_5) (connect-region o_0_15 o_4_15) (connect-region o_0_27 o_1_17) (connect-region o_0_27 o_5_27) (connect-region o_0_3 WEJSCIE_1) (connect-region o_0_3 o_1_5) (connect-region o_0_3 o_4_3) (connect-region o_12_15 o_13_17) (connect-region o_12_15 o_13_5) (connect-region o_12_15 o_16_15) (connect-region o_12_15 o_8_15) (connect-region o_12_3 KASA_3) (connect-region o_12_3 WEJSCIE_2) (connect-region o_12_3 o_13_5) (connect-region o_12_3 o_16_3) (connect-region o_12_3 o_8_3) (connect-region o_13_17 o_12_15) (connect-region o_13_17 o_13_27) (connect-region o_13_27 MAGAZYN_1) (connect-region o_13_27 o_13_17) (connect-region o_13_27 o_15_27) (connect-region o_13_27 o_7_27) (connect-region o_13_5 o_12_15) (connect-region o_13_5 o_12_3) (connect-region o_15_27 MAGAZYN_1) (connect-region o_15_27 o_13_27) (connect-region o_15_27 o_17_17) (connect-region o_16_15 o_12_15) (connect-region o_16_15 o_17_17) (connect-region o_16_15 o_17_5) (connect-region o_16_3 WEJSCIE_2) (connect-region o_16_3 o_12_3) (connect-region o_16_3 o_17_5) (connect-region o_17_17 o_15_27) (connect-region o_17_17 o_16_15) (connect-region o_17_5 o_16_15) (connect-region o_17_5 o_16_3) (connect-region o_1_17 o_0_15) (connect-region o_1_17 o_0_27) (connect-region o_1_5 o_0_15) (connect-region o_1_5 o_0_3) (connect-region o_4_15 o_0_15) (connect-region o_4_15 o_5_17) (connect-region o_4_15 o_5_5) (connect-region o_4_15 o_8_15) (connect-region o_4_3 KASA_1) (connect-region o_4_3 KASA_2) (connect-region o_4_3 o_0_3) (connect-region o_4_3 o_5_5) (connect-region o_4_3 o_8_3) (connect-region o_5_17 o_4_15) (connect-region o_5_17 o_5_27) (connect-region o_5_27 o_0_27) (connect-region o_5_27 o_5_17) (connect-region o_5_27 o_7_27) (connect-region o_5_5 o_4_15) (connect-region o_5_5 o_4_3) (connect-region o_7_27 MAGAZYN_1) (connect-region o_7_27 o_13_27) (connect-region o_7_27 o_5_27) (connect-region o_7_27 o_9_17) (connect-region o_8_15 o_12_15) (connect-region o_8_15 o_4_15) (connect-region o_8_15 o_9_17) (connect-region o_8_15 o_9_5) (connect-region o_8_3 KASA_2) (connect-region o_8_3 KASA_3) (connect-region o_8_3 o_12_3) (connect-region o_8_3 o_4_3) (connect-region o_8_3 o_9_5) (connect-region o_9_17 o_7_27) (connect-region o_9_17 o_8_15) (connect-region o_9_5 o_8_15) (connect-region o_9_5 o_8_3) (from-region o_1_5 Gumka_recepturka) (from-region o_1_5 Pomarancza_Luz) (from-region o_5_17 Coca_cola_1) (from-region o_5_17 Komputer_lenovo) (from-region o_7_27 Coca_Cola_2l) (from-region o_9_5 Coca_cola_1l) (in-region WEJSCIE_1) (kasa KASA_1) (kasa KASA_2) (kasa KASA_3))
    (:goal (and (in-kasa) (in-backpack Pomarancza_Luz) (in-backpack Gumka_recepturka) (in-backpack Komputer_lenovo) (in-backpack Coca_cola_1) (in-backpack Coca_Cola_2l) (in-backpack Coca_cola_1l)))
)

; plan
1. (move-to-region wejscie_1 o_0_3)
   deleted: (in-region wejscie_1)
   added: (in-region o_0_3)
   goals met: 0 of 7
2. (move-to-region o_0_3 o_1_5)
   deleted: (in-region o_0_3)
   added: (in-region o_1_5)
   goals met: 0 of 7
3. (take-to-backpack o_1_5 pomarancza_luz)
   added: (in-backpack pomarancza_luz)
   goals met: 1 of 7
4. (take-to-backpack o_1_5 gumka_recepturka)
   added: (in-backpack gumka_recepturka)
   goals met: 2 of 7
5. (move-to-region o_1_5 o_0_15)
   deleted: (in-region o_1_5)
   added: (in-region o_0_15)
   goals met: 2 of 7
6. (move-to-region o_0_15 o_4_15)
   deleted: (in-region o_0_15)
   added: (in-region o_4_15)
   goals met: 2 of 7
7. (move-to-region o_4_15 o_5_17)
   deleted: (in-region o_4_15)
   added: (in-region o_5_17)
   goals met: 2 of 7
8. (take-to-backpack o_5_17 komputer_lenovo)
   added: (in-backpack komputer_lenovo)
   goals met: 3 of 7
9. (take-to-backpack o_5_17 coca_cola_1)
   added: (in-backpack coca_cola_1)
   goals met: 4 of 7
10. (move-to-region o_5_17 o_5_27)
   deleted: (in-region o_5_17)
   added: (in-region o_5_27)
   goals met: 4 of 7
11. (move-to-region o_5_27 o_7_27)
   deleted: (in-region o_5_27)
   added: (in-region o_7_27)
   goals met: 4 of 7
12. (take-to-backpack o_7_27 coca_cola_2l)
   added: (in-backpack coca_cola_2l)
   goals met: 5 of 7
13. (move-to-region o_7_27 o_9_17)
   deleted: (in-region o_7_27)
   added: (in-region o_9_17)
   goals met: 5 of 7
14. (move-to-region o_9_17 o_8_15)
   deleted: (in-region o_9_17)
   added: (in-region o_8_15)
   goals met: 5 of 7
15. (move-to-region o_8_15 o_9_5)
   deleted: (in-region o_8_15)
   added: (in-region o_9_5)
   goals met: 5 of 7
16. (take-to-backpack o_9_5 coca_cola_1l)
   added: (in-backpack coca_cola_1l)
   goals met: 6 of 7
17. (move-to-region o_9_5 o_8_3)
   deleted: (in-region o_9_5)
   added: (in-region o_8_3)
   goals met: 6 of 7
18. (move-to-region o_8_3 kasa_2)
   deleted: (in-region o_8_3)
   added: (in-region kasa_2)
   goals met: 6 of 7
19. (zaplac kasa_2)
   deleted: (in-region kasa_2)
   added: (in-kasa)
   goals met: 7 of 7
